PHOTOS = {
    "main": "",
    "info": "",
    "subscription": "",
}

main_text = """
🌑 Приветствую в Obsidian Veil 🌑
Здесь встречаются знание, символы и легенды, которые помогают иначе взглянуть на мир.

Этот бот откроет доступ к:
🔒 Закрытой группе с редкими материалами и исследованиями о мифологии, символике и культурных традициях.
🔮 Индивидуальной онлайн-консультации, где разбираются личные ситуации через призму архетипов и древних знаний.
📷 Визуальному блогу, где публикуются истории и авторские проекты.
📂 Открытой группе, где можно следить за новостями и получать бесплатные материалы.

✨ Все материалы носят информационно-исследовательский характер и не являются руководством к действию.

"""

offer_text = """
📜 Публичная оферта
Настоящий документ является официальным предложением (офертой) в адрес физических и юридических лиц (далее — «Клиент») и определяет условия оказания консультационных и творческих услуг, а также изготовления амулетов индивидуального характера.
1. Общие положения
1.1. Оферта является публичной в соответствии со ст. 437 ГК РФ.
1.2. Акцептом (принятием) данной оферты считается совершение Клиентом действий по её принятию: нажатие кнопки «Согласен» / «Оформить заказ», а также фактическая оплата услуг или товаров.
1.3. С момента акцепта договор между Исполнителем (мастером) и Клиентом считается заключённым.
2. Характер оказываемых услуг
2.1. Исполнитель оказывает консультации и изготавливает изделия (амулеты), относящиеся к сфере духовных и эзотерических практик.
2.2. Услуги и изделия не являются медицинскими, психотерапевтическими, юридическими или иными профессиональными услугами.
2.3. Исполнитель не даёт гарантий наступления конкретного результата. Эффективность зависит от множества факторов, включая личную готовность Клиента к изменениям.
3. Ответственность
3.1. Клиент принимает все решения и совершает действия самостоятельно, неся полную личную ответственность за последствия.
3.2. Исполнитель не несёт ответственности за жизненные выборы Клиента и их результаты.
4. Конфиденциальность
4.1. Вся информация, полученная от Клиента в процессе оказания услуг, является конфиденциальной и не подлежит разглашению третьим лицам без согласия Клиента.
5. Оплата и возвраты
5.1. Оплата производится в полном объёме до начала оказания услуги или изготовления амулета.
5.2. В силу индивидуального характера изготавливаемых изделий (амулетов), возврат и обмен невозможны (ст. 25, 26.1 ФЗ «О защите прав потребителей»).
5.3. Консультационные услуги, оказанные Исполнителем, возврату не подлежат.
6. Согласие с условиями
6.1. Совершая акцепт (оплату или нажатие кнопки «Согласен» / «Оформить заказ»), Клиент подтверждает, что ознакомился с условиями настоящей оферты и полностью принимает их.
6.2. Претензии, основанные на ожидании определённых результатов, не подлежат удовлетворению.
Спасибо за доверие к моей работе и опыту!
"""

last_click = {}
months = [
    'января', 'февраля', 'марта', 'апреля', 'мая', 'июня',
    'июля', 'августа', 'сентября', 'октября', 'ноября', 'декабря'
]
